# 175. Combine Two Tables
[問題](https://leetcode.com/problems/combine-two-tables/description/?envType=study-plan-v2&envId=premium-sql-50)

## 解答の方針
outer joinする。

In [1]:
import pandas as pd

In [2]:
data = [[1, 'Wang', 'Allen'], [2, 'Alice', 'Bob']]
person = pd.DataFrame(data, columns=['personId', 'firstName', 'lastName']).astype({'personId':'Int64', 'firstName':'object', 'lastName':'object'})
data = [[1, 2, 'New York City', 'New York'], [2, 3, 'Leetcode', 'California']]
address = pd.DataFrame(data, columns=['addressId', 'personId', 'city', 'state']).astype({'addressId':'Int64', 'personId':'Int64', 'city':'object', 'state':'object'})

In [3]:
person

   personId firstName lastName
0         1      Wang    Allen
1         2     Alice      Bob

In [4]:
address

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [13]:
def combine_two_tables(person: pd.DataFrame, address: pd.DataFrame) -> pd.DataFrame:
    combined = person.merge(address, on="personId", how="outer")
    combined.dropna(subset="firstName", axis=0, inplace=True)
    return combined[["firstName", "lastName", "city", "state"]]

In [14]:
combine_two_tables(person, address)

  firstName lastName           city     state
0      Wang    Allen            NaN       NaN
1     Alice      Bob  New York City  New York

## Test scripts

In [6]:
result = person.merge(address, on="personId", how="outer")

In [7]:
result

   personId firstName lastName  addressId           city       state
0         1      Wang    Allen       <NA>            NaN         NaN
1         2     Alice      Bob          1  New York City    New York
2         3       NaN      NaN          2       Leetcode  California

In [8]:
result.dropna(subset="lastName", axis=0, inplace=True)

In [9]:
result

   personId firstName lastName  addressId           city     state
0         1      Wang    Allen       <NA>            NaN       NaN
1         2     Alice      Bob          1  New York City  New York

In [10]:
result[["firstName", "lastName", "city", "state"]]

  firstName lastName           city     state
0      Wang    Allen            NaN       NaN
1     Alice      Bob  New York City  New York